dwhisler/robotic_arm/PSoC/MotorTests/ArmDriver.cydsn/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "Bootloadable.h"
#include "UART.h"
#include "UART_SPI_UART.h"
#include "UART_PINS.h"
#include "UART_SPI_UART_PVT.h"
#include "UART_PVT.h"
#include "UART_BOOT.h"
#include "ADC.h"
#include "POT_1.h"
#include "POT_1_aliases.h"
#include "Clock.h"
#include "servo_1.h"
#include "servo_1_aliases.h"
#include "PWM_1.h"
#include "PWM_2.h"
#include "servo_2.h"
#include "servo_2_aliases.h"
#include "POT_2.h"
#include "POT_2_aliases.h"
#include "PWM_3.h"
#include "PWM_4.h"
#include "servo_3.h"
#include "servo_3_aliases.h"
#include "servo_4.h"
#include "servo_4_aliases.h"
#include "POT_3.h"
#include "POT_3_aliases.h"
#include "POT_4.h"
#include "POT_4_aliases.h"
#include "UART_SCBCLK.h"
#include "UART_tx.h"
#include "UART_tx_aliases.h"
#include "UART_rx.h"
#include "UART_rx_aliases.h"
#include "ADC_IRQ.h"
#include "ADC_intClock.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyLFClk.h"
#include "cy_em_eeprom.h"

/*[]*/

